Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_opa.h
/** @defgroup OPA_LL_EF_CONFIGURATION_OPA_INSTANCE Configuration of OPA hierarchical scope: OPA instance
  * @{
  */

/**
  * @brief  Set OPA functional mode by setting internal connections.
  *         OPA operation in standalone, follower, ...
  * @note   This function reset bit of calibration mode to ensure
  *         to be in functional mode, in order to have OPA parameters
  *         (inputs selection, ...) set with the corresponding OPA mode
  *         to be effective.
  * @rmtoll CSR      VMSEL          LL_OPA_SetFunctionalMode
  * @param  OPAx OPA instance
  * @param  FunctionalMode This parameter can be one of the following values:
  *         @arg @ref LL_OPA_MODE_STANDALONE
  *         @arg @ref LL_OPA_MODE_FOLLOWER
  *         @arg @ref LL_OPA_MODE_PGA
  *         @arg @ref LL_OPA_MODE_PGA_IO0
  *         @arg @ref LL_OPA_MODE_PGA_IO0_BIAS
  *         @arg @ref LL_OPA_MODE_PGA_IO0_IO1_BIAS
  * @retval None
  */
__STATIC_INLINE void LL_OPA_SetFunctionalMode(OPA_TypeDef *OPAx, uint32_t FunctionalMode)
{
  MODIFY_REG(OPAx->CSR, OPA_CSR_PGA_GAIN_4 | OPA_CSR_PGA_GAIN_3 | OPA_CSR_VM_SEL, FunctionalMode);
}

/**
  * @brief  Get OPA functional mode from setting of internal connections.
  *         OPA operation in standalone, follower, ...
  * @rmtoll CSR      VMSEL          LL_OPA_GetFunctionalMode
  * @param  OPAx OPA instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPA_MODE_STANDALONE
  *         @arg @ref LL_OPA_MODE_FOLLOWER
  *         @arg @ref LL_OPA_MODE_PGA
  *         @arg @ref LL_OPA_MODE_PGA_IO0
  *         @arg @ref LL_OPA_MODE_PGA_IO0_BIAS
  *         @arg @ref LL_OPA_MODE_PGA_IO0_IO1_BIAS
  */
__STATIC_INLINE uint32_t LL_OPA_GetFunctionalMode(OPA_TypeDef *OPAx)
{
  return (uint32_t)(READ_BIT(OPAx->CSR, OPA_CSR_PGA_GAIN_4 | OPA_CSR_PGA_GAIN_3 | OPA_CSR_VM_SEL));
}

/**
  * @brief  Set OPA PGA gain.
  * @note   Preliminarily, OPA must be set in mode PGA
  *         using function @ref LL_OPA_SetFunctionalMode().
  * @rmtoll CSR      PGGAIN         LL_OPA_SetPGAGain
  * @param  OPAx OPA instance
  * @param  PGAGain This parameter can be one of the following values:
  *         @arg @ref LL_OPA_PGA_GAIN_2_OR_MINUS_1
  *         @arg @ref LL_OPA_PGA_GAIN_4_OR_MINUS_3
  *         @arg @ref LL_OPA_PGA_GAIN_8_OR_MINUS_7
  *         @arg @ref LL_OPA_PGA_GAIN_16_OR_MINUS_15
  *         @arg @ref LL_OPA_PGA_GAIN_32_OR_MINUS_31
  *         @arg @ref LL_OPA_PGA_GAIN_64_OR_MINUS_63
  * @retval None
  */
__STATIC_INLINE void LL_OPA_SetPGAGain(OPA_TypeDef *OPAx, uint32_t PGAGain)
{
  MODIFY_REG(OPAx->CSR, OPA_CSR_PGA_GAIN_2 | OPA_CSR_PGA_GAIN_1 | OPA_CSR_PGA_GAIN_0, PGAGain);
}

/**
  * @brief  Get OPA PGA gain.
  * @note   Preliminarily, OPA must be set in mode PGA
  *         using function @ref LL_OPA_SetFunctionalMode().
  * @rmtoll CSR      PGGAIN         LL_OPA_GetPGAGain
  * @param  OPAx OPA instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPA_PGA_GAIN_2_OR_MINUS_1
  *         @arg @ref LL_OPA_PGA_GAIN_4_OR_MINUS_3
  *         @arg @ref LL_OPA_PGA_GAIN_8_OR_MINUS_7
  *         @arg @ref LL_OPA_PGA_GAIN_16_OR_MINUS_15
  *         @arg @ref LL_OPA_PGA_GAIN_32_OR_MINUS_31
  *         @arg @ref LL_OPA_PGA_GAIN_64_OR_MINUS_63
  */
__STATIC_INLINE uint32_t LL_OPA_GetPGAGain(OPA_TypeDef *OPAx)
{
  return (uint32_t)(READ_BIT(OPAx->CSR, OPA_CSR_PGA_GAIN_2 | OPA_CSR_PGA_GAIN_1 | OPA_CSR_PGA_GAIN_0));
}

/**
  * @brief  Set OPA power mode normal or highspeed.
  * @note   OPA highspeed mode allows output stage to have a better slew rate.
  * @rmtoll CSR      HIGHSPEEDEN     LL_OPA_SetPowerMode
  * @param  OPAx OPA instance
  * @param  PowerMode This parameter can be one of the following values:
  *         @arg @ref LL_OPA_POWERMODE_NORMALSPEED
  *         @arg @ref LL_OPA_POWERMODE_HIGHSPEED
  * @retval None
  */
__STATIC_INLINE void LL_OPA_SetPowerMode(OPA_TypeDef *OPAx, uint32_t PowerMode)
{
  MODIFY_REG(OPAx->CSR, OPA_CSR_OPAHSM, PowerMode);
}

/**
  * @brief  Get OPA power mode normal or highspeed.
  * @note   OPA highspeed mode allows output stage to have a better slew rate.
  * @rmtoll CSR      HIGHSPEEDEN     LL_OPA_GetPowerMode
  * @param  OPAx OPA instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPA_POWERMODE_NORMALSPEED
  *         @arg @ref LL_OPA_POWERMODE_HIGHSPEED
  */
__STATIC_INLINE uint32_t LL_OPA_GetPowerMode(OPA_TypeDef *OPAx)
{
  return (uint32_t)(READ_BIT(OPAx->CSR, OPA_CSR_OPAHSM));
}
/**
  * @}
  */


/** @defgroup OPA_LL_EF_CONFIGURATION_INPUTS Configuration of OPA inputs
  * @{
  */

/**
  * @brief  Set OPA non-inverting input connection.
  * @rmtoll CSR      VPSEL          LL_OPA_SetInputNonInverting
  * @param  OPAx OPA instance
  * @param  InputNonInverting This parameter can be one of the following values:
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO0
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO1
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO2
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO3
  *         @arg @ref LL_OPA_INPUT_NONINVERT_DAC
  * @retval None
  */
__STATIC_INLINE void LL_OPA_SetInputNonInverting(OPA_TypeDef *OPAx, uint32_t InputNonInverting)
{
  MODIFY_REG(OPAx->CSR, OPA_CSR_VP_SEL, InputNonInverting);
}

/**
  * @brief  Get OPA non-inverting input connection.
  * @rmtoll CSR      VPSEL          LL_OPA_GetInputNonInverting
  * @param  OPAx OPA instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO0
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO1
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO2
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO3
  *         @arg @ref LL_OPA_INPUT_NONINVERT_DAC
  */
__STATIC_INLINE uint32_t LL_OPA_GetInputNonInverting(OPA_TypeDef *OPAx)
{
  return (uint32_t)(READ_BIT(OPAx->CSR, OPA_CSR_VP_SEL));
}

/**
  * @brief  Set OPA inverting input connection.
  * @note   OPA inverting input is used with OPA in mode standalone
  *         or PGA with external capacitors for filtering circuit.
  *         Otherwise (OPA in mode follower), OPA inverting input
  *         is not used (not connected to GPIO pin).
  * @rmtoll CSR      VMSEL          LL_OPA_SetInputInverting
  * @param  OPAx OPA instance
  * @param  InputInverting This parameter can be one of the following values:
  *         @arg @ref LL_OPA_INPUT_INVERT_IO0
  *         @arg @ref LL_OPA_INPUT_INVERT_IO1
  *         @arg @ref LL_OPA_INPUT_INVERT_CONNECT_NO
  * @retval None
  */
__STATIC_INLINE void LL_OPA_SetInputInverting(OPA_TypeDef *OPAx, uint32_t InputInverting)
{
  /* Manage cases of OPA inverting input not connected (0x10 and 0x11)      */
  /* to not modify OPA mode follower or PGA.                                */
  /* Bit OPA_CSR_VMSEL_1 is set by OPA mode (follower, PGA). */
  MODIFY_REG(OPAx->CSR, (~(InputInverting >> 1)) & OPA_CSR_VM_SEL_0, InputInverting);
}

/**
  * @brief  Get OPA inverting input connection.
  * @rmtoll CSR      VMSEL          LL_OPA_GetInputInverting
  * @param  OPAx OPA instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPA_INPUT_INVERT_IO0
  *         @arg @ref LL_OPA_INPUT_INVERT_IO1
  *         @arg @ref LL_OPA_INPUT_INVERT_CONNECT_NO
  */
__STATIC_INLINE uint32_t LL_OPA_GetInputInverting(OPA_TypeDef *OPAx)
{
  uint32_t input_inverting = READ_BIT(OPAx->CSR, OPA_CSR_VM_SEL);

