Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_opa.h
  /* Manage cases 0x10 and 0x11 to return the same value: OPA inverting     */
  /* input not connected.                                                     */
  return (input_inverting & ~((input_inverting >> 1) & OPA_CSR_VM_SEL_0));
}

/**
  * @brief  Set OPA non-inverting input secondary connection.
  * @rmtoll TCMR     VPSSEL         LL_OPA_SetInputNonInvertingSecondary
  * @param  OPAx OPA instance
  * @param  InputNonInverting This parameter can be one of the following values:
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO0_SEC
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO1_SEC
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO2_SEC
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO3_SEC
  *         @arg @ref LL_OPA_INPUT_NONINVERT_DAC_SEC
  * @retval None
  */
__STATIC_INLINE void LL_OPA_SetInputNonInvertingSecondary(OPA_TypeDef *OPAx, uint32_t InputNonInverting)
{
  MODIFY_REG(OPAx->TCMR, OPA_TCMR_VPS_SEL, InputNonInverting);
}

/**
  * @brief  Get OPA non-inverting input secondary connection.
  * @rmtoll TCMR     VPSSEL         LL_OPA_GetInputNonInvertingSecondary
  * @param  OPAx OPA instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO0_SEC
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO1_SEC
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO2_SEC
  *         @arg @ref LL_OPA_INPUT_NONINVERT_IO3_SEC
  *         @arg @ref LL_OPA_INPUT_NONINVERT_DAC_SEC
  */
__STATIC_INLINE uint32_t LL_OPA_GetInputNonInvertingSecondary(OPA_TypeDef *OPAx)
{
  return (uint32_t)(READ_BIT(OPAx->TCMR, OPA_TCMR_VPS_SEL));
}

/**
  * @brief  Set OPA inverting input secondary connection.
  * @note   OPA inverting input is used with OPA in mode standalone
  *         or PGA with external capacitors for filtering circuit.
  *         Otherwise (OPA in mode follower), OPA inverting input
  *         is not used (not connected to GPIO pin).
  * @rmtoll TCMR     VMSSEL         LL_OPA_SetInputInvertingSecondary
  * @param  OPAx OPA instance
  * @param  InputInverting This parameter can be one of the following values:
  *         @arg @ref LL_OPA_INPUT_INVERT_IO0_SEC
  *         @arg @ref LL_OPA_INPUT_INVERT_IO1_SEC
  *         @arg @ref LL_OPA_INPUT_INVERT_PGA_SEC
  *         @arg @ref LL_OPA_INPUT_INVERT_FOLLOWER_SEC
  * @retval None
  */
__STATIC_INLINE void LL_OPA_SetInputInvertingSecondary(OPA_TypeDef *OPAx, uint32_t InputInverting)
{
  MODIFY_REG(OPAx->TCMR, OPA_TCMR_VMS_SEL, InputInverting);
}

/**
  * @brief  Get OPA inverting input secondary connection.
  * @rmtoll TCMR     VMSSEL         LL_OPA_GetInputInvertingSecondary
  * @param  OPAx OPA instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPA_INPUT_INVERT_IO0_SEC
  *         @arg @ref LL_OPA_INPUT_INVERT_IO1_SEC
  *         @arg @ref LL_OPA_INPUT_INVERT_PGA_SEC
  *         @arg @ref LL_OPA_INPUT_INVERT_FOLLOWER_SEC
  */
__STATIC_INLINE uint32_t LL_OPA_GetInputInvertingSecondary(OPA_TypeDef *OPAx)
{
  return (uint32_t)(READ_BIT(OPAx->TCMR, OPA_TCMR_VMS_SEL));
}

/**
  * @brief  Set OPA inputs multiplexer mode.
  * @rmtoll TCMR     TCMEN          LL_OPA_SetInputsMuxMode
  * @param  OPAx OPA instance
  * @param  InputsMuxMode This parameter can be one of the following values:
  *         @arg @ref LL_OPA_INPUT_MUX_DISABLE
  *         @arg @ref LL_OPA_INPUT_MUX_TIM1_CH6
  *         @arg @ref LL_OPA_INPUT_MUX_TIM8_CH6
  * @retval None
  */
__STATIC_INLINE void LL_OPA_SetInputsMuxMode(OPA_TypeDef *OPAx, uint32_t InputsMuxMode)
{
  MODIFY_REG(OPAx->TCMR, OPA_TCMR_T1CM_EN | OPA_TCMR_T8CM_EN, InputsMuxMode);
}

/**
  * @brief  Get OPA inputs multiplexer mode.
  * @rmtoll TCMR     TCMEN          LL_OPA_GetInputsMuxMode
  * @param  OPAx OPA instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPA_INPUT_MUX_DISABLE
  *         @arg @ref LL_OPA_INPUT_MUX_TIM1_CH6
  *         @arg @ref LL_OPA_INPUT_MUX_TIM8_CH6
  */
__STATIC_INLINE uint32_t LL_OPA_GetInputsMuxMode(OPA_TypeDef *OPAx)
{
  return (uint32_t)(READ_BIT(OPAx->TCMR, OPA_TCMR_T1CM_EN | OPA_TCMR_T8CM_EN));
}

/**
  * @brief  Set OPA internal output.
  * @note   OPA internal output is used to link OPA output to ADC input internally.
  * @rmtoll CSR      OPAINTEN     LL_OPA_SetInternalOutput
  * @param  OPAx OPA instance
  * @param  InternalOutput This parameter can be one of the following values:
  *         @arg @ref LL_OPA_INTERNAL_OUPUT_DISABLED
  *         @arg @ref LL_OPA_INTERNAL_OUPUT_ENABLED
  * @retval None
  */
__STATIC_INLINE void LL_OPA_SetInternalOutput(OPA_TypeDef *OPAx, uint32_t InternalOutput)
{
  MODIFY_REG(OPAx->CSR, OPA_CSR_OPAINTOEN, InternalOutput);
}

/**
  * @brief  Get OPA internal output state.
  * @rmtoll CSR      OPAINTEN     LL_OPA_GetInternalOutput
  * @param  OPAx OPA instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPA_INTERNAL_OUPUT_DISABLED
  *         @arg @ref LL_OPA_INTERNAL_OUPUT_ENABLED
  */
__STATIC_INLINE uint32_t LL_OPA_GetInternalOutput(OPA_TypeDef *OPAx)
{
  return READ_BIT(OPAx->CSR, OPA_CSR_OPAINTOEN);
}

/**
  * @brief  Set OPA Voltage Build in.
  * @rmtoll CSR      OPA_VBIAS     LL_OPA_SetVoltageBuildIn
  * @param  OPAx OPA instance
  * @param  VccDiv This parameter can be one of the following values:
  *         @arg @ref LL_OPA_VOLTAGEBUILDIN_VCC_DIV2
  *         @arg @ref LL_OPA_VOLTAGEBUILDIN_VCC_DIV5
  * @retval None
  */
__STATIC_INLINE void LL_OPA_SetVoltageBuildIn(OPA_TypeDef *OPAx, uint32_t VccDiv)
{
  MODIFY_REG(OPAx->CSR, OPA_CSR_OPA_VBIAS, VccDiv);
}

/**
  * @brief  Get OPA Voltage Build in
  * @rmtoll CSR      OPA_VBIAS     LL_OPA_GetVoltageBuildIn
  * @param  OPAx OPA instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPA_VOLTAGEBUILDIN_VCC_DIV2
  *         @arg @ref LL_OPA_VOLTAGEBUILDIN_VCC_DIV5
  */
__STATIC_INLINE uint32_t LL_OPA_GetVoltageBuildIn(OPA_TypeDef *OPAx)
{
  return READ_BIT(OPAx->CSR, OPA_CSR_OPA_VBIAS);
}

/**
  * @brief  Enable OPA Voltage BuildIn.
  * @rmtoll CSR      OPA_VBSEL       LL_OPA_EnableVoltageBuildIn
  * @param  OPAx OPA instance
  * @retval None
  */
__STATIC_INLINE void LL_OPA_EnableVoltageBuildIn(OPA_TypeDef *OPAx)
{
  SET_BIT(OPAx->CSR, OPA_CSR_OPA_VBSEL);
}

/**
  * @brief  Disable OPA Voltage BuildIn.
  * @rmtoll CSR      OPA_VBSEL       LL_OPA_DisableVoltageBuildIn
  * @param  OPAx OPA instance
  * @retval None
  */
__STATIC_INLINE void LL_OPA_DisableVoltageBuildIn(OPA_TypeDef *OPAx)
{
  CLEAR_BIT(OPAx->CSR, OPA_CSR_OPA_VBSEL);
}

/**
  * @brief  Get OPAVoltage BuildIn enable state
  * @rmtoll CSR      OPA_VBSEL       LL_OPA_IsEnabledVoltageBuildIn
  * @param  OPAx OPA instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_OPA_IsEnabledVoltageBuildIn(OPA_TypeDef *OPAx)
{
  return ((READ_BIT(OPAx->CSR, OPA_CSR_OPA_VBSEL) == (OPA_CSR_OPA_VBSEL)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup OPA_LL_EF_OPERATION Operation on OPA instance
  * @{
  */
/**
  * @brief  Enable OPA instance.
  * @note   After enable from off state, OPA requires a delay
  *         to fulfill wake up time specification.
  *         Refer to device datasheet, parameter "tWAKEUP".
  * @rmtoll CSR      OPAEN       LL_OPA_Enable
  * @param  OPAx OPA instance
  * @retval None
  */
__STATIC_INLINE void LL_OPA_Enable(OPA_TypeDef *OPAx)
{
  SET_BIT(OPAx->CSR, OPA_CSR_OPAEN);
}

/**
  * @brief  Disable OPA instance.
  * @rmtoll CSR      OPAEN       LL_OPA_Disable
  * @param  OPAx OPA instance
  * @retval None
  */
__STATIC_INLINE void LL_OPA_Disable(OPA_TypeDef *OPAx)
{
  CLEAR_BIT(OPAx->CSR, OPA_CSR_OPAEN);
}

/**
  * @brief  Get OPA instance enable state
  *         (0: OPA is disabled, 1: OPA is enabled)
  * @rmtoll CSR      OPAEN       LL_OPA_IsEnabled
  * @param  OPAx OPA instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_OPA_IsEnabled(OPA_TypeDef *OPAx)
{
  return ((READ_BIT(OPAx->CSR, OPA_CSR_OPAEN) == (OPA_CSR_OPAEN)) ? 1UL : 0UL);
}

/**
  * @brief  Lock OPA instance.
  * @note   Once locked, OPA configuration can be accessed in read-only.
  * @note   The only way to unlock the OPA is a device hardware reset.
  * @rmtoll CSR      LOCK           LL_OPA_Lock
  * @param  OPAx OPA instance
  * @retval None
  */
__STATIC_INLINE void LL_OPA_Lock(OPA_TypeDef *OPAx)
{
  SET_BIT(OPAx->CSR, OPA_CSR_LOCK);
}

/**
  * @brief  Get OPA lock state
  *         (0: OPA is unlocked, 1: OPA is locked).
  * @note   Once locked, OPA configuration can be accessed in read-only.
  * @note   The only way to unlock the OPA is a device hardware reset.
  * @rmtoll CSR      LOCK           LL_OPA_IsLocked
  * @param  OPAx OPA instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_OPA_IsLocked(OPA_TypeDef *OPAx)
{
  return ((READ_BIT(OPAx->CSR, OPA_CSR_LOCK) == (OPA_CSR_LOCK)) ? 1UL : 0UL);
}

/**
  * @brief  Lock OPA instance timer controlled mux
  * @note   Once locked, OPA timer controlled mux configuration can be accessed in read-only.
  * @note   The only way to unlock the OPA timer controlled mux is a device hardware reset.
  * @rmtoll TCMR     LOCK           LL_OPA_LockTimerMux
  * @param  OPAx OPA instance
  * @retval None
  */
__STATIC_INLINE void LL_OPA_LockTimerMux(OPA_TypeDef *OPAx)
{
  SET_BIT(OPAx->TCMR, OPA_TCMR_LOCK);
}

/**
  * @brief  Get OPA timer controlled mux lock state
  *         (0: OPA timer controlled mux is unlocked, 1: OPA timer controlled mux is locked).
  * @note   Once locked, OPA timer controlled mux configuration can be accessed in read-only.
  * @note   The only way to unlock the OPA timer controlled mux is a device hardware reset.
  * @rmtoll TCMR     LOCK           LL_OPA_IsTimerMuxLocked
  * @param  OPAx OPA instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_OPA_IsTimerMuxLocked(OPA_TypeDef *OPAx)
{
  return ((READ_BIT(OPAx->TCMR, OPA_TCMR_LOCK) == (OPA_TCMR_LOCK)) ? 1UL : 0UL);
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup OPA_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

ErrorStatus LL_OPA_DeInit(OPA_TypeDef *OPAx);
ErrorStatus LL_OPA_Init(OPA_TypeDef *OPAx, LL_OPA_InitTypeDef *OPA_InitStruct);
void        LL_OPA_StructInit(LL_OPA_InitTypeDef *OPA_InitStruct);

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* OPA1 || OPA2 || OPA3  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* PY32E407_LL_OPA_H */

